; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v5 ?v11)
             (pred_6 ?v7 ?v10)
             (pred_7 ?v5 ?v10)
             (pred_9 ?v12 ?v5 )
	     (pred_1 ?v5)
             (pred_4 ?v13)
             (pred_8 ?v7)
             (pred_10 ?v10)
             (pred_12 ?v5)
             (pred_3 ?v7)
             (pred_5 ?v5)
             (pred_2 ))



(:action op_3
:parameters (?v1 ?v8 ?v4 ?v9)
:precondition (and (pred_4 ?v1) (pred_4 ?v8) (pred_8 ?v4) (pred_10 ?v9)
          (pred_11 ?v1 ?v8) (pred_6 ?v4 ?v9)
                   (pred_7 ?v8 ?v9) (pred_1 ?v1) 
                   (pred_12 ?v8) (pred_3 ?v4))
:effect (and  (pred_5 ?v8) (not (pred_12 ?v8))))


(:action op_4
:parameters (?v1 ?v3)
:precondition (and (pred_4 ?v1) (pred_4 ?v3)
               (pred_1 ?v1) (pred_11 ?v1 ?v3) (pred_5 ?v3))
:effect (and (pred_1 ?v3) (not (pred_1 ?v1))))

(:action op_1
:parameters (?v1 ?v4)
:precondition (and (pred_4 ?v1) (pred_8 ?v4) 
                  (pred_1 ?v1) (pred_9 ?v4 ?v1) (pred_2 ))
:effect (and (pred_3 ?v4)
   (not (pred_9 ?v4 ?v1)) (not (pred_2 ))))


(:action op_2
:parameters (?v1 ?v6 ?v2)
:precondition (and (pred_4 ?v1) (pred_8 ?v6) (pred_8 ?v2)
                  (pred_1 ?v1) (pred_3 ?v2) (pred_9 ?v6 ?v1))
:effect (and (pred_3 ?v6) (pred_9 ?v2 ?v1)
        (not (pred_3 ?v2)) (not (pred_9 ?v6 ?v1))))

(:action op_5
:parameters (?v1 ?v4)
:precondition (and (pred_4 ?v1) (pred_8 ?v4) 
                  (pred_1 ?v1) (pred_3 ?v4))
:effect (and (pred_2 ) (pred_9 ?v4 ?v1) (not (pred_3 ?v4)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_15 obj_05 obj_07 obj_10 obj_14 obj_12 obj_01 obj_09 obj_16 obj_22 obj_11 obj_17 obj_04 obj_13 obj_03 obj_20
    obj_06 obj_02 obj_21
    obj_08 obj_19 obj_18
    )

    (:init
       (pred_2)

       (pred_4 obj_15)
       (pred_4 obj_05)
       (pred_4 obj_07)
       (pred_4 obj_10)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_22)
       (pred_4 obj_11)
       (pred_4 obj_17)
       (pred_4 obj_04)
       (pred_4 obj_13)
       (pred_4 obj_03)
       (pred_4 obj_20)
       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_10 obj_21)
       (pred_8 obj_08)
       (pred_8 obj_19)
       (pred_8 obj_18)

       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_05)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_07)
       (pred_11 obj_05 obj_15)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_10)
       (pred_11 obj_07 obj_05)
       (pred_11 obj_10 obj_09)
       (pred_11 obj_10 obj_07)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_12 obj_22)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_12 obj_14)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_09 obj_10)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_22)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_22 obj_12)
       (pred_11 obj_22 obj_16)
       (pred_11 obj_11 obj_03)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_17 obj_20)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_11)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_20 obj_17)
       (pred_11 obj_20 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_7  obj_11 obj_06)
       (pred_7  obj_14 obj_02)
       (pred_7  obj_09 obj_21)
       (pred_5 obj_15)
       (pred_5 obj_05)
       (pred_5 obj_07)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_5 obj_01)
       (pred_5 obj_16)
       (pred_5 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_04)
       (pred_5 obj_13)
       (pred_5 obj_03)
       (pred_5 obj_20)

       (pred_6  obj_08 obj_06)
       (pred_6  obj_19 obj_02)
       (pred_6  obj_18 obj_21)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_18 obj_20)
       (pred_1 obj_16)
    )

    (:goal (and
       (pred_9 obj_19 obj_10)
    ))
(:constraints
  (always (not (pred_1 obj_05)))
)
)

; plan
1. (op_1 obj_16 obj_19)
   deleted: (pred_9 obj_19 obj_16) (pred_2)
   added: (pred_3 obj_19)
   goals met: 0 of 1
2. (op_4 obj_16 obj_22)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_22)
   goals met: 0 of 1
3. (op_4 obj_22 obj_12)
   deleted: (pred_1 obj_22)
   added: (pred_1 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_01)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_01)
   goals met: 0 of 1
5. (op_4 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 0 of 1
6. (op_4 obj_07 obj_10)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_10)
   goals met: 0 of 1
7. (op_5 obj_10 obj_19)
   deleted: (pred_3 obj_19)
   added: (pred_2) (pred_9 obj_19 obj_10)
   goals met: 1 of 1
